Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
ht_de01.menu.EventsCore.1=Core 1
ht_de01.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
ht_de01.menu.EventsCore.0=Core 0
ht_de01.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

ht_de01.menu.CPUFreq.240=240MHz (WiFi)
ht_de01.menu.CPUFreq.240.build.f_cpu=240000000L
ht_de01.menu.CPUFreq.160=160MHz (WiFi)
ht_de01.menu.CPUFreq.160.build.f_cpu=160000000L
ht_de01.menu.CPUFreq.80=80MHz (WiFi)
ht_de01.menu.CPUFreq.80.build.f_cpu=80000000L
ht_de01.menu.CPUFreq.40=40MHz
ht_de01.menu.CPUFreq.40.build.f_cpu=40000000L
ht_de01.menu.CPUFreq.20=20MHz
ht_de01.menu.CPUFreq.20.build.f_cpu=20000000L
ht_de01.menu.CPUFreq.10=10MHz
ht_de01.menu.CPUFreq.10.build.f_cpu=10000000L

ht_de01.menu.UploadSpeed.921600=921600
ht_de01.menu.UploadSpeed.921600.upload.speed=921600
ht_de01.menu.UploadSpeed.115200=115200
ht_de01.menu.UploadSpeed.115200.upload.speed=115200
ht_de01.menu.UploadSpeed.256000.windows=256000
ht_de01.menu.UploadSpeed.256000.upload.speed=256000
ht_de01.menu.UploadSpeed.230400.windows.upload.speed=256000
ht_de01.menu.UploadSpeed.230400=230400
ht_de01.menu.UploadSpeed.230400.upload.speed=230400
ht_de01.menu.UploadSpeed.460800.linux=460800
ht_de01.menu.UploadSpeed.460800.macosx=460800
ht_de01.menu.UploadSpeed.460800.upload.speed=460800
ht_de01.menu.UploadSpeed.512000.windows=512000
ht_de01.menu.UploadSpeed.512000.upload.speed=512000

ht_de01.menu.DebugLevel.none=None
ht_de01.menu.DebugLevel.none.build.code_debug=0
ht_de01.menu.DebugLevel.error=Error
ht_de01.menu.DebugLevel.error.build.code_debug=1
ht_de01.menu.DebugLevel.warn=Warn
ht_de01.menu.DebugLevel.warn.build.code_debug=2
ht_de01.menu.DebugLevel.info=Info
ht_de01.menu.DebugLevel.info.build.code_debug=3
ht_de01.menu.DebugLevel.debug=Debug
ht_de01.menu.DebugLevel.debug.build.code_debug=4
ht_de01.menu.DebugLevel.verbose=Verbose
ht_de01.menu.DebugLevel.verbose.build.code_debug=5


ht_de01.menu.einksize.0=eink_150
ht_de01.menu.einksize.0.build.einksize=150;
ht_de01.menu.einksize.1=eink_154
ht_de01.menu.einksize.1.build.einksize=154;
ht_de01.menu.einksize.2=eink_213
ht_de01.menu.einksize.2.build.einksize=213;
ht_de01.menu.einksize.3=eink_290
ht_de01.menu.einksize.3.build.einksize=290;

ht_de01.build.defines=   -DEINK={build.einksize}   -D{build.board}
##############################################################

